[
    { "fact": "Most job openings are never advertised—they’re filled through networking." },
    { "fact": "On average, recruiters spend just 6–8 seconds reviewing a resume." },
    { "fact": "85% of jobs are filled through networking." },
    { "fact": "A strong LinkedIn profile increases your chances of getting hired by 40%." },
    { "fact": "Soft skills like communication and teamwork are among the top attributes employers seek." },
    { "fact": "Job hopping can boost your career early by exposing you to various experiences." },
    { "fact": "Employers value relevant experience more than a high GPA." },
    { "fact": "70% of internships turn into full-time job offers." },
    { "fact": "The average time to hire a candidate is around 42 days." },
    { "fact": "Recruiters often check your social media before deciding to hire you." },
    { "fact": "Including measurable achievements on your resume can increase its impact." },
    { "fact": "Customizing your resume for each job improves your chances of getting hired." },
    { "fact": "Many companies use ATS (Applicant Tracking Systems) to scan resumes." },
    { "fact": "Good cover letters can help your application stand out." },
    { "fact": "Having a personal portfolio or website can enhance your professional image." },
    { "fact": "Remote jobs have increased significantly since 2020." },
    { "fact": "Tech-related roles are among the highest in-demand jobs today." },
    { "fact": "Referrals increase your chances of getting hired by 4x." },
    { "fact": "Consistency between your resume and LinkedIn profile matters." },
    { "fact": "Hiring managers value cultural fit as much as skills." },
    { "fact": "Most hiring decisions are made in the first 10 minutes of an interview." },
    { "fact": "Body language in interviews plays a big role in first impressions." },
    { "fact": "Freelancing is becoming a viable full-time career option." },
    { "fact": "Soft skills are harder to teach than technical skills." },
    { "fact": "Asking thoughtful questions in interviews can impress interviewers." },
    { "fact": "Following up after an interview increases your chances of being hired." },
    { "fact": "Internships can help you explore career paths before committing." },
    { "fact": "Attending job fairs and events can uncover hidden job opportunities." },
    { "fact": "Many top companies offer virtual internship opportunities now." },
    { "fact": "Your email address should sound professional on your resume." },
    { "fact": "Gaps in employment aren’t always red flags if explained well." },
    { "fact": "It’s okay to negotiate your salary — 70% of employers expect it." },
    { "fact": "Volunteering and side projects can count as valuable experience." },
    { "fact": "Being active on platforms like GitHub or Behance showcases your skills." },
    { "fact": "Certifications in your field can boost your resume." },
    { "fact": "Career coaches and mentors can accelerate your growth." },
    { "fact": "Knowing your strengths and weaknesses helps in job interviews." },
    { "fact": "You should research a company before applying or interviewing." },
    { "fact": "Professional attire still matters in virtual interviews." },
    { "fact": "Preparing STAR (Situation, Task, Action, Result) answers helps in interviews." },
    { "fact": "You don't need a perfect resume — you need a relevant one." },
    { "fact": "LinkedIn endorsements can strengthen your profile." },
    { "fact": "Employers are increasingly open to hiring remote international talent." },
    { "fact": "Career growth often happens faster in startups." },
    { "fact": "Project-based experience is often more valuable than academic achievements." },
    { "fact": "A growth mindset is a top trait companies look for." },
    { "fact": "Companies now value emotional intelligence more than ever." },
    { "fact": "Self-learning and online courses are highly respected in tech jobs." },
    { "fact": "Following companies on LinkedIn can alert you to job openings early." },
    { "fact": "Side hustles can sometimes lead to full-time jobs." },
    { "fact": "Digital portfolios are essential for design and creative roles." },
    { "fact": "Even entry-level jobs can demand relevant internship experience." },
    { "fact": "Resumes with action verbs are more impactful." },
    { "fact": "Tailored resumes have a 75% higher response rate." },
    { "fact": "You can list personal projects on your resume." },
    { "fact": "Networking doesn’t mean asking for jobs — it means building connections." },
    { "fact": "Professional summaries help recruiters grasp your value quickly." },
    { "fact": "Your resume should be no longer than 1 page for entry-level roles." },
    { "fact": "Using bullet points helps make your resume more readable." },
    { "fact": "Many companies offer internal training for upskilling." },
    { "fact": "Internships aren’t limited to students — graduates can apply too." },
    { "fact": "Job titles may differ for similar roles across companies." },
    { "fact": "Recruiters appreciate clear, simple language in resumes." },
    { "fact": "Most hiring happens in January and February." },
    { "fact": "Job boards like Indeed, LinkedIn, and Glassdoor are great starting points." },
    { "fact": "Being honest about your experience builds trust." },
    { "fact": "ATS prefers standard fonts like Arial, Calibri, and Times New Roman." },
    { "fact": "Including relevant keywords boosts your resume's ATS ranking." },
    { "fact": "Digital literacy is a basic requirement in most industries today." },
    { "fact": "Video resumes are gaining popularity in creative industries." },
    { "fact": "Internships teach both technical and workplace skills." },
    { "fact": "Leadership experience in clubs or events is worth including." },
    { "fact": "Many companies post internships on their career pages first." },
    { "fact": "You can turn freelance projects into full-time roles with clients." },
    { "fact": "Cold emailing recruiters can open unexpected doors." },
    { "fact": "Virtual job interviews are often recorded for team reviews." },
    { "fact": "Consistency in your online professional profiles builds credibility." },
    { "fact": "Learning basic Excel, PowerPoint, or Google Sheets is a must." },
    { "fact": "Always send a thank-you note after interviews." },
    { "fact": "Mock interviews help improve your confidence and delivery." },
    { "fact": "Cover letters should focus on value, not just your background." },
    { "fact": "Students can gain experience through hackathons, case studies, and competitions." },
    { "fact": "AI is now used in screening resumes and interviews." },
    { "fact": "You can use ChatGPT to improve your resume and prep for interviews." },
    { "fact": "Glassdoor reviews give insight into company culture." },
    { "fact": "GitHub contributions can help land you a software engineering role." },
    { "fact": "Behavioral interviews test how you handle real-world scenarios." },
    { "fact": "Employers want problem-solvers and self-starters." },
    { "fact": "LinkedIn Learning offers certifications that appear on your profile." },
    { "fact": "Being punctual in interviews shows professionalism." },
    { "fact": "Communication skills are important in every industry." },
    { "fact": "Having a referral from an employee increases your chances of hiring significantly." },
    { "fact": "Remote jobs require strong time management skills." },
    { "fact": "Learning basic project management can help in almost any role." },
    { "fact": "Job descriptions often list 'nice-to-have' skills—apply even if you don’t meet all." },
    { "fact": "Regularly updating your resume keeps you ready for any opportunity." },
    { "fact": "Even your email signature can serve as a mini resume." },
    { "fact": "Asking for feedback after rejections helps you improve." },
    { "fact": "An internship abroad adds international exposure to your resume." },
    { "fact": "Most students underestimate the power of networking early." },
    { "fact": "Following industry influencers on LinkedIn can keep you informed." },
    { "fact": "There are job roles today that didn’t exist 5 years ago." },
    { "fact": "You can learn any skill online with dedication and consistency." }
  ]
  